Repository: n8rob/corpora
Catalog: french_haitian/archive/en-ht (1).tmx
Source language: en
Languages: ht

source: I think in a future presentation I'll explain why this works and maybe you might even kind of have an intuition because the 1 is in the ten's place, and this is the ten's place.
ht: Nan yon lòt prezantasyon mwen va di ou poukisa sa mache trè byen, ou ka menm kòmanse ap fè tèt ou travay paske en an nan kategori dizèn yo, ou sonje! epitou se la ki plas dizèn yo

source: I don't want to confuse you. So you have that 1 and now you add it to the 2, and you get 35.
ht: Mwen pa vle ou pèdi pye non, ou genyen chif en sa a ou mete li sou li sou tèt chif de a, epi nou genyen trèz

source: Because 1+2=3, right?
ht: Paske en plis de egal twa, se pa sa?

source: So you're done.
ht: Bon! Ou fini.

source: And you might ask, well, does that make sense that 28+7=35?
ht: Ou dwe ap di, pou di bagay sa a gen sans ventuit plis sèt egal trann-senk?

source: And there's a couple of ways I'd like to think about this.
ht: Genyen plizyè fason mwen ta kab reflechi sou bagay sa a

source: Well, 8+7 we know is 15, right?
ht: Antouka, nou konnen uit plis sèt egal kenz, se sa?

source: And I don't know how comfortable you are with higher numbers.
ht: Mwen pa konnen si ou santi ou anfòm Ak gwo chif yo.

source: But 8+7 -- so look at this pattern.
ht: Men... dizuit plis sèt - suiv jan sa mache

source: 8+7=15. 18+7 -- you're probably saying, Sal, where are you getting the 18 from, but take my word for it.
ht: Uit plis sèt egal kenz dizuit plis sèt - ou dwe ap di nan kè ou, Dyo ki kote ou soti ak dizuit la, men make mo mwen.

source: 28+7=35 which is the one that we just did.
ht: Vent-uit plis sèt egal trann-senk, se sa nou fenk sot fè a.

source: That is a check mark.
ht: Mwen mete yon kwochè

source: And if you kept going, you said 38+7, that actually equals 45.
ht: Si ou kontinye, ou kab di trant-uit plis sèt egal karann-senk.

source: So you might see a little pattern here, and then you can just sit and think about this for a little bit if you like.
ht: Konsa, ou kab wè kijan sa mache epi ou kab Si ou vle, ou ka Pran yon ti tan pou ou panse sou sa si ou vle tou, ou kab mete videyo-a sou poz.

source: Another way you could think about this, if you still don't believe me, is you say, okay, if I have 28, if I add 1, I get 29.
ht: Yon lòt fason ou kab reflechi sou sa Si ou pa kwè toujou, se pou ou di, bon, si mwen gen vent-uit, mwen ajoute yonn sou li, mwen ap genyen vent-nèf

source: If I add 2, I get 30. If I add 3, I get 31.
ht: Si mwen mete de sou li, mwen ap genyen trente-yen.

source: If I add 4, I get 32.
ht: Si mwen mete kat sou li, mwen ap genyen trenn-de.

source: If I add 5, I get 33.
ht: Si mwen mete senk sou li, mwen ap genyen trann-twa.

source: If I add 6, I get 34.
ht: Si mwen mete sis sou li, mwen ap genyen trann-kat.

source: And if I add 7, I get 35 again.
ht: Epi si mwen mete sèt sou li, mwen ap vin genyen trann-senk ankò,

source: Right, all I did is I kept saying oh, if I had one more
ht: Oke, sèl sa mwen te fè, mwen kontinye ap di oo!

source: I'll get larger a little bit -- the number a little bit larger.
ht: Si mwen kontinye ajoute sou li mwen ap vin genyen pi plis - epi chif la ap vin yon ti jan pi gwo.

source: Let's do some more problems, and I think we'll do a couple more.
ht: An nou fè pi plis pwoblèm. Mwen kwè nou kapab. Fè de lòt ankò.

source: Let's do it a little faster because you might get what we're doing here now.
ht: An nou fè sa yon ti kras pi vit, paske ou kab konprann pi byen kounye a.

source: Let's do a hard one.
ht: An nou fè yonn ki pi difisil.

source: Let's do 99+9.
ht: An nou di katreven-diz-nèf plis nèf.

source: So what's 9+9?
ht: Kisa nèf plis nèf egal?

source: So if you don't know what it is, you can work it out either using the number line or drawing the circles.
ht: Si ou pa konnen repons lan, ou kab fè adisyon an yon fason vizyèl Ou kab sèvi ak liy chif yo oubyen ou kab fè plizyè wonn

source: And, you know that's a fair way to do it, although you should eventually kind of know it.
ht: Se kòrèk, ou kab fè sa, men Ou ta dwe konnen jan pou ou fè sa

source: 9+9 it turns out is 18.
ht: Nèf plis nèf gen lè fè diz-uit.

source: 9+9 is equal to 18...so 9+9... and you put the 8 down here and you carry the 1.
ht: Nèf plis nèf egal diz-uit ... donk, nèf plis nèf ... epi Ou ekri uit-la la-a en an se retni.

source: And now you just say 1+9.
ht: Epi kounye a, ou ap sèlman di en plis nèf.

source: Well you know what 1+9 is.
ht: Bon, ou konnen kisa en plis nèf egal.

source: And so there's nowhere to carry this 1, so you write the whole thing down here.
ht: Kounye a pa gen okenn lòt kote pou mete retni an Ou sèlman ekri tout chif la

source: So 99+9=108.
ht: Konsa katreven-diz-nèf plis en egal san uit

source: Let's do one more problem.
ht: An nou fè yon lòt pwoblèm.

source: Let's say 56+7.
ht: An nou di senkann-sis plis sèt.

source: Well what's six plus seven.
ht: Bon, se sis plis sèt.

source: Well 6+7=13, right?
ht: Bon, sis plis sèt egal trèz, se sa?

source: If you get confused, draw out everything again.
ht: Si ou santi ou vle pèdi, ekri ranje chif yo ankò.

source: And then you get 1+5.
ht: Epi ou ap genyen en plis senk.

source: And you might want to give yourself a bunch of problems and I think you're also now, if you understand what we did, ready to try the level 2 addition problems.
ht: Epitou ou kab eseye kreye yon bann lòt pwoblèm pou ou rezoud Si ou te byen konprann, mwen kwè se sa menm, sa ou ap fè kounye a, Ou pare pou ou fè adisyon ak retni.

source: Have fun!
ht: Bòn chans!

source: Where I left off in the last video, we talked about how the hemoglobin in red blood cells is what sops up all of the oxygen so that it increases the diffusion gradient-- or it increases the incentive, we could say, for the oxygen to go across the membrane.
ht: Te kote m kite nan videyo dènye a, nou pale osijè de kòman a moglobin globil wouj nan san nan se sa sops tèt de la oksijèn pou ke li ogmante piblikasyon dégradé - ou li ogmante incentive a, nou te kapab di pou oksijèn pou aller au len a.

source: We know that the oxygen molecules don't know that there's less oxygen here, but if you watch the video on diffusion you know how that process happens.
ht: Nou konnen ke molécules oksijèn yo pa konnen sa pa gen mwens oksijèn isit la, men si ou gade videyo a sou piblikasyon ou konnen ki jan pwosesis sa rive.

source: If there's less concentration here than there, the oxygen will diffuse across the membrane and there's less inside the plasma because the hemoglobin is sucking it all up like a sponge.
ht: Si ta gen mwens konsantrasyon isit la pase la a, la oksijèn ap diffuse dans la len Et se moins anndan an ikid ki nan san paske moglobin a sise tout leve tankou yon enyen ak yon eponj.

source: Now, one interesting question is, why does the hemoglobin even have to reside within the red blood cells?
ht: Koulye a, yon sèl kesyon enteresan se, poukisa moglobin a bezwen pou se nan selil wouj yo?

source: Why aren't hemoglobin proteins just freely floating in the blood plasma?
ht: Poukisa pa moglobin protéines jis librement flotan nan a ikid ki nan san san?

source: That seems more efficient.
ht: Ki sanble devni pi efikas.

source: You don't have to have things crossing through, in and out of, these red blood cell membranes.
ht: Ou pa bezwen gen bagay à travers, ap fè antre de, yo wouj nan san sèlil membranes.

source: You wouldn't have to make red blood cells.
ht: Ou pa gen pou fè globil wouj nan san.

source: What's the use of having these containers of hemoglobin?
ht: Nan ki sa wap sèvi ak l pa gen sa yo kontenè moglobin

source: It's actually a very interesting idea.
ht: Li se aktyèlman yon trè bon lide.

source: If you had all of the hemoglobin sitting in your blood plasma, it would actually hurt the flow of the blood.
ht: Si ou te fè tout moun chita moglobin a ou ikid ki nan san san, li ta fè aktyèlman mal flux nan san.

source: The blood would become more viscous or more thick.
ht: San ki pral rive plis visqueux ou plis byen pwès.

source: I don't want to say like syrup, but it would become thicker than blood is right now-- and by packaging the hemoglobin inside these containers, inside the red blood cells, what it allows the blood to do is flow a lot better.
ht: Mwen pa vle di tankou siwo, men, sa ki pral rive plus pase san kounye a ­ e pa emballage a moglobin anndan kontenè sa yo, anndan wouj la selil, kisa li pèmèt san fè se flux pi bon.

source: Imagine if you wanted to put syrup in water.
ht: Imajine te si ou vle mete sirop nan dlo.

source: If you just put syrup straight into water, what's going to happen?
ht: Si ou jis mete sirop menm lè a tou nan dlo a, sa ki pwal pase?

source: The water's going to become a little syrupy, a little bit more viscous and not flow as well.
ht: Va dlo a tounen yon ti kras syrupy, yon ti jan plis visqueux Et pa flux osi byen.

source: So what's the solution if you wanted to transport syrup in water?
ht: Se konsa sa ye a solisyon si nou te vle pou yo sirop transpò nan dlo?

source: Well, you could put the syrup inside little containers or inside little beads and then let the beads flow in the water and then the water wouldn't be all gooey-- and that's exactly what's happening inside of our blood.
ht: Men, ou te kapab mete siro a anndan ti kontenè ou anndan ti perles Et puis je kolye yo flux nan a dlo ak lè sa a dlo a pas être tout gooey - Et sa se ekzateman sak pase andedan touye nou.

source: Instead of having the hemoglobin sit in the plasma and make it gooey, it sits inside these beads that we call red blood cells that allows the flow to still be non-viscous.
ht: Olye ke yo gen moglobin a chita nan a ikid ki nan san Apre sa, fè l' gooey, li se anndan perles sa yo nou sa rele globil wouj nan san ki pèmèt flux pou yo toujou fè ki pa-visqueux.

source: So I've been all zoomed in here on the alveolus and these capillaries, these pulmonary capillaries-- let's zoom out a little bit-- or zoom out a lot-- just to understand, how is the blood flowing?
ht: Se konsa mwen te gen te tout zoomed isit la sou lveyòl a ak sa kapilè, kapilè pulmonaire sa yo an nou rale yon ti kras - ou rale soti yon bann - jis pou konprann, jan san an ap koule?

source: And get a better understanding of pulmonary arteries and veins relative to the other arteries and veins that are in the body.
ht: Jwenn yon pi bon compréhension de pulmonaire artères Et varis relative to a lòt artères Et varis sa yo nan kò sa a.

source: So here-- I copied this from Wikipedia, this diagram of the human circulatory system-- and here in the back you can see the lungs.
ht: Se konsa isit lan-- mwen copié sa de Wikipedya, dyagram sa a de la moun san/sikilatwa - Et pase isit la nan dèyè ou kapab wè poumon.

source: Let me do it in a nice dark color.
ht: Se pou m' fè l' nan yon bèl koulè nwa.

source: So we have our lungs here.
ht: Se poutèt sa, nou dwe poumon nou isit la. Ou kapab wè kè chita bò dwat nan mitan.

source: And what we learned in the last few videos is that we have our little alveoli and our lungs.
ht: Sa nou jwenn nan pase kèk vidéos, se sa nou gen ti alveoli nou ak poumon nou.

source: Remember, we get to them from our bronchioles, which are branching off of the bronchi, which branch off of the trachea, which connects to our larynx, which connects to our pharynx, which connects to our mouth and nose.
ht: Pa bliye, nou pran yo nan bronchioles nou an, ki se plen delivre wonch yo, ki direction hors de la kannal souf/lè, ki connects pou nou òd vokal/vwa ki connects pou nou èyè gòj, ki connects pou soti nan bouch nou yo ak bwa nen.

source: But anyway, we have our little alveoli right there and then we have the capillaries.
ht: Men, de tout fason, nou pa gen dwa ti alveoli nou gen lè konsa moun nou gen kapilè.

source: So when we go away from the heart-- and we're going to delve a little bit into the heart in this video as well-- so when blood travels away from the heart, it's de-oxygenated.
ht: Se konsa, lè nou kite kè - e nou pwal fouye yon ti jan antre nan kè moun nan videyo sa a tou ­ Se konsa lè san se kite tèt ou, se de-oxygenated.

source: It's this blue color.
ht: Li se koulè ble sa a.

source: So this right here is blood.
ht: Se poutèt sa isit-menm se san.

source: This right here is blood traveling away from the heart.
ht: Isit-menm se san vwayaje kite kè moun.

source: It's going behind these two tubes right there.
ht: Sa ap dèyè ti tiyo sa yo de nou la a.

source: So this is the blood going away from the heart.
ht: Se poutèt sa se san an ta pwale kite kè.

source: So this blue that I've been highlighting just now, these are the pulmonary arteries and then they keep splitting into arterials and all of that and eventually we're in capillaries-- super, super small tubes.
ht: Se poutèt sa a ble ke mwen te gen te en jis kounye a, sa sont les artères pulmonaire Et lè sa a yo kenbe division nan arterials ak tou de sa Et evantyèlman nan sa kapilè - super, super ti ti tiyo nou.

source: They run right past the alveoli and then they become oxygenated and now we're going back to the heart.
ht: Yo kouri byen pase alveoli yo, lè sa a yo vin ksijene Et koulye a nou pral tounen kè moun.

source: So we're talking about pulmonary veins.
ht: Se konsa nou pale osijè de pulmonaire varis.

source: So we go back to the heart.
ht: Se poutèt sa, nou tounen al jwenn kè moun.

source: So these capillaries-- in the capillaries we get oxygen.
ht: Se poutèt sa yo kapilè-nan kapilè nou jwenn oksijèn.

source: Now we're going to go back to the heart.
ht: Koulye a nou pral tounen nan kè moun.

source: Hope you can see what I'm doing.
ht: Espere ke ou kapab wè sa m' ap fè.

source: And we're going to enter the heart on this side.
ht: E nou pwal antre nan kè moun sou bò sa a.

source: You actually can't even see where we're entering the heart.
ht: Ou aktyèlman pa menm wè kote nou ap antre nan kè moun.

source: We're going to enter the heart right over here-- and I'm going to go into more detail on that.
ht: Nou pwal antre nan kè a droit sou ici - Et mwen menm pwal antre nan plis detay sou sa.

source: Now we have oxygenated blood.
ht: Koulye a, nou te ksijene san.

source: It's red.
ht: Li wouj.

source: And then that gets pumped out to the rest of the body.
ht: Et puis sa obtient pompe deyò pou tout rès kò a.

source: Now this is the interesting thing.
ht: Koulye a sa se bagay enteresan.

source: When we're talking about pulmonary arteries and veins-- remember, the pulmonary artery was blue.
ht: Lè nou pale osijè de pulmonaire artères Et varis- pa bliye, la pulmonaire venn kè li te genyen ble.

source: As we go away from the heart, we have de-oxygenated blood, but it's still an artery.
ht: Menm jan nou kite nan kè moun, nou te de-oxygenated san, Men, se toujou yon gwo venn.

source: Then as we go towards the heart from the lungs, we have a vein, but it's oxygenated.
ht: Lè sa a menm jan nou ale bò kote kè a nan poumon, nou pran yon venn nan janm, men ksijene. Se poutèt sa se sa a ti bouk la ke nou kòmanse ak mwen menm pwal kontinye sou menm lanse sou fòm sikilasyon paske kè a kapab resevwa yon ti Confusion, sitou paske de trois nati li.

source: But what we have is, the heart pumps de-oxygenated blood from the right ventricle.
ht: Men, sa nou genyen se, kè pompes de-oxygenated koule soti kote dwat gwo seksyon kè.

source: You're saying, hey, why is it the right ventricle?
ht: Ou di, alo, Poukisa se li dwat gwo seksyon kè?

source: That looks like the left side of the drawing, but it's this dude's right-hand side, right?
ht: Ki sanble sou bò gòch lan de dessin a, men, se sa a dude a droite bò, bon?

source: This is this guy's right hand.
ht: Sa se men dwat nèg sa a.

source: And this is this dude's left hand.
ht: Et, se sa rele dude sa a pase men gòch.

source: He's looking at us, right?
ht: Li gade nou, dwat?

source: We don't care about our right or left.
ht: Nou pa swen sou nou dwat ou bò gòch.

source: We care about this guy's right and left.
ht: Nou okipe osijè de nèg sa a droit Et kite.

source: And he's looking at us.
ht: Apre sa, li gade nou.

source: He's got some eyeballs and he's looking at us.
ht: Li te genyen kèk p'ap fèmen Et li gade nou.

source: So this is his right ventricle.
ht: Se poutèt sa se gwo seksyon kè l' dwat.

source: Actually, let me just start off with the whole cycle.
ht: Aktyèlman, kite m' sèlman kòmanse avèk tout ik a.

source: So we have de-oxygenated blood coming from the rest of the body, right?
ht: Se konsa nou fè de-oxygenated san ki te soti nan tout rès la kò, dwat?

source: The name for this big pipe is called the inferior vena cava-- inferior because it's coming up below.
ht: Non sa a gwo fif pou yo rele la vena enferyè cava - enferyè paske l' ap anba.

source: Actually, you have blood coming up from the arms and the head up here.
ht: Ou gen san t' ap sòti de zam yo aktyèlman, Et tèt la anwo.

source: They're both meeting right here, in the right atrium.
ht: Yo ap les kontre droit isit la, nan atrium dwat la.

source: Let me label that.
ht: Kite m' étiquette sa.

source: I'm going to do a big diagram of the heart in a second.
ht: M pral fè yon gwo dyagram de kè a nan yon lòt. Et, poukisa yo de-oxygenated?

source: Because this is blood returning from our legs if we're running, or returning from our brain, that had to use respiration-- or maybe we're working out and it's returning from our biceps, but it's de-oxygenated blood.
ht: Paske, sa se san ki te retounen nan pye nou si nou gen yon ti, ou retounen nan sèvo nou, ki te gen pou sèvi ak bouch nan bouch - ou ap petèt nou ap travay sou Et se retounen nan nou gwo/bwa ponyèt, men, li te de-oxygenated san.

source: It shows up right here in the right atrium.
ht: Li montre ke isit nan atrium dwat la.

source: It's on our left, but this guy's right-hand side.
ht: Se sou bò gòch nou, men se bò droite nèg sa a.

source: From the right atrium, it gets pumped into the right ventricle.
ht: De atrium dwat la, li jwenn pompe nan byen gwo seksyon kè.

source: It actually passively flows into the right ventricle.
ht: Li aktyèlman passive flux nan gwo seksyon kè dwat.

source: The ventricles do all the pumping, then the ventricle contracts and pumps this blood right here-- and you don't see it, but it's going behind this part right here.
ht: Ventricles yo fè tout a estime, lè sa a tout gwo seksyon kè contrats Et pompes dwat ici - Et ou pa wè sa a san li, men va dèyè pati sa a isit.

source: It goes from here through this pipe.
ht: Sa va soti isit la nan fè tiyo sa a.

source: So you don't see it.
ht: Se konsa ou pa wè l.

source: I'm going to do a detailed diagram in a second-- into the pulmonary artery.
ht: Mwen pral fè yon dyagram detaye nan nan yon dezyèm - a gwo venn pulmonaire.

source: We're going away from the heart.
ht: Nou pral kite kè moun.

source: This was a vein, right?
ht: Sa te yon venn nan janm dwat?

source: This is a vein going to the heart.
ht: Sa se yon venn nan janm ale nan kè moun.

source: This is a vein, inferior vena cava vein.
ht: Sa se yon venn nan, cava vena enferyè venn nan janm.

source: This is superior vena cava.
ht: Sa se siperyè vena cava.

source: These are veins.
ht: Se sa varis yo.

source: They're de-oxygenated.
ht: Yo ap de-oxygenated.

source: Then I'm pumping this de-oxygenated blood away from the heart to the lungs.
ht: Lè sa a mwen menm ki estime sa a de-oxygenated san wete l ' nan konprann pou yo sa poumon.

source: Now this de-oxygenated blood, this is in an artery, right?
ht: Koulye a sa de-oxygenated, sa san nan venn kè yon, dwat?

source: This is in the pulmonary artery.
ht: Sa se yon gwo pulmonaire a venn.

source: It gets oxygenated and now it's a pulmonary vein.
ht: Obtient ksijene koulye a se yon venn nan kou pulmonaire.

source: And once it's oxygenated, it shows up here in the left-- let me do a better color than that-- it shows up right here in the left atrium.
ht: Ak yon fwa ke li ksijene, li montre ke isit la nan bò gòch- kite m' fè yon koulè pi bon pase sa - li montre ke dwat la anwo nan a gòch atrium.

source: Atrium, you can imagine-- it's kind of a room with a skylight or that's open to the outside and in both of these cases, things are entering from above-- not sunlight, but blood is entering from above.
ht: Atrium, ou ka konprann - se ti jan yon chanm ak yon du ou louvri lan ak nan tou le de ka sa yo, bagay ki antre nan from above - pa solèy, men san antre soti anwo.

source: On the right atrium, the blood is entering from above.
ht: Sou bon atrium a, san antre soti anwo.

source: And in the left atrium, the blood is entering-- and remember, the left atrium is on the right-hand side from our point of view-- on the left atrium, the blood is entering from above from the lungs, from the pulmonary veins.
ht: Et nan gòch atrium a, san antre - Et pa bliye, a gòch atrium se sou bò droite de nou pwen de vi-sou a gòch atrium, san an se antre soti anwo nan poumon, de venn pulmonaire.

source: Then it goes into-- and I'll go into more detail-- into the left ventricle and then the left ventricle pumps that oxygenated blood to the rest of the body via the non-pulmonary arteries.
ht: Lè sa a, li al nan - Et mwen ap antre nan plis detay - a gòch gwo seksyon kè Et puis gòch gwo seksyon kè pompes sa ksijene san pou tout rès kò a via la ki pa-pulmonaire artères.

source: So everything pumps out.
ht: Se konsa tout bagay pompes deyò.

source: Let me make it a nice dark, non-blue color.
ht: Kite m' fè l' yon bon nwa, ki pa twal koulè.

source: So it pumps it out through there.
ht: Se konsa li pompes kite l' pase a.

source: You don't see it right here, the way it's drawn.
ht: Ou pa wè l' droit isit la, jan li établie.

source: It's a little bit of a strange drawing.
ht: Li se yon ti kras nan yon lòt dessin.

source: It's hard to visualize, but I'll show it in more detail and then it goes to the rest of the body.
ht: Li difisil pou visualiser, men, m a fè l' an plis detay epi Apre sa, li li pou tout rès kò a.

source: Let me show you that detail right now.
ht: Kite m montre ou detay sa kounye a. Se konsa, nou di: nou te de-oxygenated san.

source: Let's label it right here.
ht: An n li étiquette droit isit la.

source: This is the superior vena cava.
ht: Sa se siperyè cava vena.

source: This is a vein from the upper part of our body from our arms and heads.
ht: Sa se yon venn nan janm soti anwo pati nan kò nou nan ponyèt nou ak tèt yo.

source: This is the inferior vena vaca.
ht: Sa se vaca enferyè vena a.

source: This is veins from our abdomen and from our legs and the rest of our body.
ht: Sa se varis soti nan vant nou ak nan pye nou yo ak tout lòt nan kò nou.

source: So it it first enters the right atrium.
ht: Se konsa, li l' premye antre atrium dwat la.

source: Remember, we call the right atrium because this is someone's heart facing us, even though this is on the left-hand side.
ht: Pa bliye, nou rele atrium dwat la, paske se kè yon moun à nou, menm si sa sou a bò sou bò gòch.

source: It enters through here.
ht: Li antre nan isit la.

source: It's de-oxygenated blood.
ht: Li te de-oxygenated san.

source: It's coming from veins. the body used the oxygen.
ht: L ap vini de varis. kò a te itilize oksijèn an.

source: Then it shows up in the right ventricle, right?
ht: Lè sa a li montre ke nan gwo seksyon an bon kè, dwat?

source: These are valves in our heart.
ht: Se sa yo konnen tiyo nan kè nou.

source: And it passively, once the right ventricle pumps and then releases, it has a vacuum and it pulls more blood from the right atrium.
ht: Et sa façon, que byen gwo seksyon kè pompes Et puis communiqués, li gen yon bale Et sa ke yo retire plis san nan a dwat atrium.

source: It pumps again and then it pushes it through here.
ht: Pompes ankò lè sa a li andousi li nan isit la.
